Revit 2027 API
MEPNetworkIterator.GetAnalyticalNode Method
 Gets the analytical node at the current iteration step.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public MEPAnalyticalNode GetAnalyticalNode()
Public Function GetAnalyticalNode As MEPAnalyticalNode
public:
MEPAnalyticalNode^ GetAnalyticalNode()
member GetAnalyticalNode : unit -> MEPAnalyticalNode
Return Value
MEPAnalyticalNode
 The retrieved node.
See Also
Reference
MEPNetworkIterator Class
Autodesk.Revit.DB.Analysis Namespace